# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 8 # number of classes
depth_multiple: 0.67 # model depth multiple
width_multiple: 0.75 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# Modified YOLOv5 backbone with ConViT-inspired architecture
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [24, 7, 2, 2]], # 0 - ConViT: Conv layer with kernel size 7
    [-1, 1, nn.MaxPool2d, [3, 2, 1]], # 1 - ConViT: MaxPool layer
    [-1, 1, Conv, [48, 3, 1, 1]], # 2 - ConViT: Conv layer with kernel size 3
    [-1, 1, nn.MaxPool2d, [3, 2, 1]], # 3 - ConViT: MaxPool layer
    [-1, 1, Conv, [96, 3, 1, 1]], # 4 - ConViT: Conv layer with kernel size 3
    [-1, 1, nn.MaxPool2d, [3, 2, 1]], # 5 - ConViT: MaxPool layer
    [-1, 2, C3, [96, 96, 2]], # 6 - Bottleneck (C3) layer
    [-1, 1, Conv, [192, 3, 2]], # 7 - Transition layer: Conv layer
    [-1, 4, C3, [192, 192, 4]], # 8 - Standard YOLOv5 Bottleneck (C3) layer
    [-1, 1, Conv, [384, 3, 2]], # 9 - Transition layer: Conv layer
    [-1, 6, C3, [384, 384, 6]], # 10 - Standard YOLOv5 Bottleneck (C3) layer
    [-1, 1, Conv, [768, 3, 2]], # 11 - Transition layer: Conv layer
    [-1, 2, C3, [768, 768, 2]], # 12 - Standard YOLOv5 Bottleneck (C3) layer
    [-1, 1, SPPF, [768, 768, 5]], # 13 - Standard YOLOv5 SPPF layer
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [384, 1, 1]], # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    [[-1, 10], 1, Concat, [1]], # 16 - cat backbone P4
    [-1, 2, C3, [384, 384, 2, False]], # 17 (P3/8-small)

    [-1, 1, Conv, [192, 1, 1]], # 18
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 19
    [[-1, 8], 1, Concat, [1]], # 20 - cat backbone P3
    [-1, 2, C3, [192, 192, 2, False]], # 21 (P3/8-small)

    [-1, 1, Conv, [192, 3, 2]], # 22
    [[-1, 17], 1, Concat, [1]], # 23 - cat head P4
    [-1, 2, C3, [384, 384, 2, False]], # 24 (P4/16-medium)

    [-1, 1, Conv, [384, 3, 2]], # 25
    [[-1, 12], 1, Concat, [1]], # 26 - cat head P5
    [-1, 2, C3, [768, 768, 2, False]], # 27 (P5/32-large)

    [[21, 24, 27], 1, Detect, [nc, anchors]], # 28 - Detect(P3, P4, P5)
  ]
